app/views/pages/index.html.erb

                        <div class="home-image">
                            <%= image_tag home.home_photos[0].image.url if home.home_photos.length > 0 %>
---
SELECT `home_photos`.* FROM `home_photos` WHERE `home_photos`.`home_id` = 13