app/controllers/contact_pages_controller.rb

INSERT INTO `contact_pages` (`first_name`, `last_name`, `email`, `phone`, `do_you_have_land`, `moving_time_frame`, `financing`, `town_planning_to_build`, `state`, `assist_you`, `created_at`, `updated_at`) VALUES ('dsgsdgdfg', 'dfgdfg', 'fdgdfgfdfdgf', 'fdgsdfgfd', 'no', '30-60', 'yes', 'dvDV', 'Kansas', 'vzxcvxcv', '2017-02-20 06:46:44', '2017-02-20 06:46:44')
---
 def create
#  render text: contact_page_params.to_yaml and return

  @contact_page = ContactPage.new(contact_page_params)
#   if @contact_page.valid?
 if    @contact_page.save