app/controllers/pages_controller.rb

SELECT  `homes`.* FROM `homes` ORDER BY `homes`.`id` DESC LIMIT 8
---
 def index
 	 @homes = Home.last(8)